{
  "backend/main.mo": "Motoko canister implementing access control, user profiles, and file/folder metadata with authorization and blob-storage mixins.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected files, components, and test IDs for two recent enhancements.",
  "frontend-file-summaries.txt": "List of frontend file paths with short descriptions of each component’s purpose and behavior.",
  "frontend/docs/smoke-test-open.md": "Manual smoke‑test checklist verifying file open behavior across views, menus, blockers, and error cases.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color variables and light/dark theme tokens.",
  "frontend/index.html": "Basic HTML entry point loading the React app with the VaultLeaf Drive title.",
  "frontend/README.md": "Project overview describing VaultLeaf Drive features, prerequisites, and setup instructions.",
  "frontend/src/App.tsx": "Main React component controlling authentication, actor initialization, profile setup flow, and rendering the file manager.",
  "frontend/src/components/auth/AuthGate.tsx": "Unauthenticated landing screen with marketing content and Internet Identity login handling.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog for first‑time users to create a username, submitting via sign‑up mutation with validation and toast feedback.",
  "frontend/src/components/drive/Breadcrumbs.tsx": "Renders navigable breadcrumb trail for current folder using folder hierarchy and triggers navigation callbacks.",
  "frontend/src/components/drive/ConfirmDeleteDialog.tsx": "Modal dialog asking user to confirm deletion of a file or folder with optional progress state.",
  "frontend/src/components/drive/CreateFolderDialog.tsx": "Dialog for creating a new folder, handling name input, mutation, and success/error toasts.",
  "frontend/src/components/drive/ExportFolderButton.tsx": "Button or menu item that exports a folder as a ZIP file and shows a progress dialog during export.",
  "frontend/src/components/drive/FileActions.tsx": "Provides file-level actions like open, download, rename, move, and delete through a dropdown menu and dialogs.",
  "frontend/src/components/drive/FileManager.tsx": "Main drive browser managing folder navigation, search, sorting, views, uploads, and selection state.",
  "frontend/src/components/drive/FileUploader.tsx": "Handles multi-file upload with progress tracking, error handling, and status display inside a dialog.",
  "frontend/src/components/drive/FolderActions.tsx": "Dropdown menu for folder actions including export, rename, and delete, with confirmation dialogs.",
  "frontend/src/components/drive/ItemContextMenu.tsx": "Provides a context menu for file and folder actions including open, download, move, rename, and delete with supporting dialogs.",
  "frontend/src/components/drive/ItemGrid.tsx": "Renders files and folders in a responsive grid with selection, context menus, and basic metadata display.",
  "frontend/src/components/drive/ItemList.tsx": "Displays files and folders in a table layout with selection, context menus, and metadata like size and modified date.",
  "frontend/src/components/drive/MoveItemDialog.tsx": "Dialog for selecting a destination folder and moving a file using moveFile mutation.",
  "frontend/src/components/drive/RenameDialog.tsx": "Dialog for renaming files or folders using rename mutations with validation and feedback.",
  "frontend/src/components/drive/SearchBar.tsx": "A simple search input with icon for filtering files and folders.",
  "frontend/src/components/drive/SelectionToolbar.tsx": "Toolbar for bulk actions on selected items, mainly delete with confirmation.",
  "frontend/src/components/drive/SortControls.tsx": "Controls for selecting sort field and direction via dropdown and toggle button.",
  "frontend/src/components/drive/ViewToggle.tsx": "Provides list/grid view toggle buttons for the file manager.",
  "frontend/src/components/feedback/ActorInitWarningBanner.tsx": "Displays a warning banner for recoverable actor init issues with a retry button.",
  "frontend/src/components/feedback/ConnectingState.tsx": "Shows a loading screen while establishing a drive connection.",
  "frontend/src/components/feedback/DriveBrowseErrorState.tsx": "Renders an error state for drive loading failures with retry and sign‐out options.",
  "frontend/src/components/feedback/EmptyState.tsx": "Displays an empty state message for an empty drive or folder.",
  "frontend/src/components/feedback/LoadingState.tsx": "Shows skeleton placeholders while loading file or folder data.",
  "frontend/src/components/layout/TopBar.tsx": "Implements the top navigation bar with theme switcher, user info, and login/logout controls.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor, refetching dependent queries on identity changes.",
  "frontend/src/hooks/useDriveActor.ts": "Wraps useActor with initialization state handling and retry logic.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, login/logout handling, and identity loading.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profiles, folders, and files using the drive actor.",
  "frontend/src/index.css": "Defines Tailwind base styles, theme variables, and global styling.",
  "frontend/src/main.tsx": "App entrypoint initializing React, query client, identity provider, and global styles.",
  "frontend/src/utils/errors.ts": "Provides functions to normalize backend errors into user-friendly messages and detect auth or connection-related errors.",
  "frontend/src/utils/fileOpen.ts": "Determines MIME types, checks browser-viewability, and opens or downloads files with fallbacks and toast notifications.",
  "frontend/src/utils/folderExport.ts": "Recursively collects folder contents and generates a simple ZIP-like blob for download with optional progress reporting.",
  "frontend/src/utils/urlParams.ts": "Handles reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, animations, and plugins for styling the frontend.",
  "project_state.json": "Tracks project state, features, issues, and high-level goals for building a Drive-like web app."
}